Repository: Legend-Gaming/legendv3-cogs
Catalog: cleanupDEBUG/locales/*.po
Languages: es_es, hu_hu, nb_no, tr_tr

source: This cog contains commands used for "cleaning up" (deleting) messages. This is designed as a moderator tool and offers many convenient use cases. All cleanup commands only apply to the channel the command is executed in. Messages older than two weeks cannot be mass deleted. This is a limitation of the API.
es_es: Este módulo contiene comandos usados para "limpiar" (eliminar) mensajes. Esto está diseñado como una herramienta de moderación y ofrece muchos casos de uso convenientes. Todos los comandos de limpieza sólo se aplican al canal en el que se ejecuta el comando. Los mensajes anteriores a dos semanas no pueden ser eliminados en masa. Esto es una limitación de la API.
hu_hu: Ez a cog üzenetek "tisztogatására" (törlésére) szolgáló parancsokat tartalmaz. Ez egy moderációs eszköznek lett tervezve, és számos kényelmes funckiót tartalmaz. Az összes tisztogató parancs arra a csatornára vonatkozik, ahol az ki volt adva. A két hétnél régebbi üzenetek nem törölhetőek csoportosan. Ez az API limitációja.
nb_no: Denne cog'en inneholder kommandoer som brukes for "rengjør opp" (slette) meldinger. Denne er utformet som et moderatorverktøy og tilbyr mange praktiske brukssaker. Alle oppryddingskommandoer gjelder bare for kanalen kommandoen kjøres i. Meldinger eldre enn to uker kan ikke masseslettes. Dette er en begrensning i APIet.
tr_tr: Bu cog mesajları "temizlemek" (silmek) için kullanılan komutlar içerir. Bu sunucu yöneticileri için bir araç olarak tasarlanmıştır ve çok sayıda rahatlık sağlar. Temizlik komutlarının tamamı sadece komutun içinde çalıştırıldığı kanala etki eder. İki haftadan eski mesajlar topluca silinemez. Bu Discord tarafından getirilmiş bir kısıtlamadır.

source: Are you sure you want to delete {number} messages? (y/n)
es_es: Estas seguro que quieres borrar {number} mensajes? (y/n)
hu_hu: Biztosan törölni akarsz {number} üzenetet? (y/n)
nb_no: Er du sikker på at du vil slette {number} meldinger? (y/n)
tr_tr: {number} iletileri silmek istediğinizden emin misiniz? (e/h)

source: Cancelled.
es_es: Cancelado.
hu_hu: Megszakítva.
nb_no: Kansellert.
tr_tr: İptal.

source: Base command for deleting messages.
es_es: Comando base para eliminar mensajes.
hu_hu: Alap parancs üzenetek törlésére.
nb_no: Basiskommando for sletting av meldinger.
tr_tr: Mesajları silmek için kullanılan temel komut.

source: Delete the last X messages matching the specified text. Example: - `[p]cleanup text "test" 5` Remember to use double quotes. **Arguments:** - `<number>` The max number of messages to cleanup. Must be a positive integer. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Eliminar los últimos X mensajes que coincidan con el texto especificado. Ejemplo: - `[p]texto de limpieza "test" 5` Recuerda usar comillas dobles. **Argumentos:** - `<number>` El número máximo de mensajes a limpiar. Debe ser un entero positivo. - `<delete_pinned>` Si eliminar o no los mensajes fijos. Por defecto es False
hu_hu: Törli az utolsó X üzenetet, ami egyezik a megadott szöveggel. Például: - `[p]cleanup text "teszt" 5` Ne felejtsd el használni az idézőjeleket **Paraméterek:** - `<number>` A törlendő üzenetek maximális száma. Pozitív egész szám kell legyen. - `<delete_pinned>` Törölje-e a kitűzött üzeneteket is. Alapértelmezetten hamis (False)
nb_no: Slett de siste X meldingene som matcher den angitte teksten. Eksempel: -[p]cleanup text "test" 5` Husk å bruke doble anførselstegn. **Argumenter:** - `<number>` Maks antall meldinger å rydde opp. Må være et positivt heltall. - `<delete_pinned>` om å slette låste meldinger eller ikke. Standarder til usant
tr_tr: Belirtilen yazıyla uyuşan son X adet mesajı sil. Örnek: - `[p]cleanup text "test" 5` Çift tırnak kullanmayı unutmayın. **Seçenekler:** - `<sayı>` The max number of messages to cleanup. Must be a positive integer. - `<sabit_silme>` Sabit mesajların silinip silinmeyeceği. Varsayılan olarak kapalıdır. (False)

source: Delete the last X messages from a specified user. Examples: - `[p]cleanup user @Twentysix 2` - `[p]cleanup user Red 6` **Arguments:** - `<user>` The user whose messages are to be cleaned up. - `<number>` The max number of messages to cleanup. Must be a positive integer. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Eliminar los últimos X mensajes de un usuario especificado. Ejemplos: - `[p]limpiar usuario @Twentysix 2` - `[p]limpiar usuario rojo 6` **Argumentos:** - `<user>` El usuario cuyos mensajes serán limpiados. - `<number>` El número máximo de mensajes a limpiar. Debe ser un entero positivo. - `<delete_pinned>` Si eliminar mensajes fijados o no. Por defecto es False
hu_hu: Törli az utolsó X üzenetet egy adott felhasználótól. Például: - `[p]cleanup user @Twentysix 2` - `[p]cleanup user Red 6` **Paraméterek:** - `<user>` Felhasználó, akinek az üzeneteit törölni szeretnénk. - `<number>`A törlendő üzenetek maximális száma. Pozitív egész szám kell legyen. - `<delete_pinned>` Törölje-e a kitűzött üzeneteket is. Alapértelmezetten hamis (False)
nb_no: Slett de siste X meldingene som matcher den angitte teksten. Eksempel: -[p]cleanup text "test" 5` Husk å bruke doble anførselstegn. **Argumenter:** - `<number>` Maks antall meldinger å rydde opp. Må være et positivt heltall. - `<delete_pinned>` om å slette låste meldinger eller ikke. Standarder til usant
tr_tr: Belirtilen kullanıcıdan son X adet mesajı sil. Örnekler: - `[p]cleanup user @Twentysix 2` - `[p]cleanup user Red 6` **Seçenekler:** - `<kullanıcı>` The user whose messages are to be cleaned up. - `<sayı>` The max number of messages to cleanup. Must be a positive integer. - `<sabit_silme>` Sabit mesajların silinip silinmeyeceği. Varsayılan olarak kapalıdır. (False)

source: Delete all messages after a specified message. To get a message id, enable developer mode in Discord's settings, 'appearance' tab. Then right click a message and copy its id. **Arguments:** - `<message_id>` The id of the message to cleanup after. This message won't be deleted. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Borrar todos los mensajes después de un mensaje especificado. Para obtener un id de mensaje, habilitar el modo de desarrollador en la configuración de Discord, pestaña de 'apariencia'. Luego haga clic derecho en un mensaje y copie su id. **Argumentos:** - `<message_id>` El id del mensaje a limpiar después. Este mensaje no se eliminará - `<delete_pinned>` Si desea eliminar o no los mensajes fijos. Por defecto es False
hu_hu: Törli az összes üzenetet, ami a megadott után következik. Az üzenet ID megszerzéséhez engedélyezd a fejlesztői módot a Discord beállításaiban a "Megjelenés" fülön. Ezután jobb klikkelj egy üzeneten és másold ki az ID-jét. **Paraméterek:** - `<message_id>` Az üzenet ID-je, amitől kezdve törölni akarsz. Ez az üzenet még nem lesz törölve. - `<delete_pinned>` Törölje-e a kitűzött üzeneteket is. Alapértelmezetten hamis (False)
nb_no: Slett alle meldinger etter en spesifisert melding. For å få beskjed Id aktiver utviklermodus i Discord's innstillinger, 'utseende' fanen. Deretter klikker du en melding og kopierer sin id. **Argumenter:** - `<message_id>` Meldingens id for å rydde opp senere. Denne meldingen vil ikke bli slettet. - `<delete_pinned>` om å slette låste meldinger eller ikke. Standarder til usant
tr_tr: Belirtilen bir mesajdan sonraki tüm mesajları sil. Bir mesaj Idsi edinmek için Discord ayarlarına girip "görünüm" sekmesinden geliştirici modunu açın. Sonra bir mesaja sağ tıklayıp Idsini kopyalayın. **Seçenkler:** - `<mesaj_idsi>` Sonrasındaki mesajlar silinecek olan mesajın Idsi. Bu mesajın kendisi silinmez. -`<sabit_silme>` Sabit mesajların silinip silinmeyeceği. Varsayılan olarak kapalıdır. (False)

source: Message not found.
es_es: Mensaje no encontrado.
hu_hu: Üzenet nem található.
nb_no: Melding ikke funnet.
tr_tr: Mesaj bulunamadı.

source: Deletes X messages before the specified message. To get a message id, enable developer mode in Discord's settings, 'appearance' tab. Then right click a message and copy its id. **Arguments:** - `<message_id>` The id of the message to cleanup before. This message won't be deleted. - `<number>` The max number of messages to cleanup. Must be a positive integer. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Elimina X mensajes antes del mensaje especificado. Para obtener un id de mensaje, habilitar el modo de desarrollador en la configuración de Discord, pestaña de 'apariencia'. Luego haga clic derecho en un mensaje y copie su id. **Argumentos:** - `<message_id>` El id del mensaje a limpiar antes. Este mensaje no se eliminará. - `<number>` El número máximo de mensajes a limpiar. Debe ser un entero positivo. - `<delete_pinned>` Si eliminar mensajes fijados o no. Por defecto es False
hu_hu: Törli az összes üzenetet, ami a megadott előtt következik. Az üzenet ID megszerzéséhez engedélyezd a fejlesztői módot a Discord beállításaiban a "Megjelenés" fülön. Ezután jobb klikkelj egy üzeneten és másold ki az ID-jét. **Paraméterek:** - `<message_id>` Az üzenet ID-je, ami előtt törölni akarsz. Ez az üzenet már nem lesz törölve. - `<number>` A törlendő üzenetek maximális száma. Pozitív egész szám kell legyen. - `<delete_pinned>` Törölje-e a kitűzött üzeneteket is. Alapértelmezetten hamis (False)
nb_no: Sletter X meldinger før den angitte meldingen. For å få beskjed Id aktiver utviklermodus i Discord's innstillinger, 'utseende' fanen. Deretter klikker du en melding og kopierer sin id. **Argumenter:** - `<message_id>` Id-en til meldingen for å rydde opp før. Denne meldingen vil ikke bli slettet. - `<number>` Maks antall meldinger som skal opp. Må være et positivt heltall. - `<delete_pinned>` om å slette låste meldinger eller ikke. Standarder til usant
tr_tr: Belirtilen mesajdan önceki X adet mesajı siler. Bir mesaj Idsi edinmek için Discord ayarlarına girip "görünüm" sekmesinden geliştirici modunu açın. Sonra bir mesaja sağ tıklayıp Idsini kopyalayın. **Seçenekler:** - `<mesaj_idsi>` Öncesindeki mesajlar silinecek olan mesajın Idsi. Bu mesajın kendisi silinmez. - `<sayı>` Silinecek mesaj sayısı, pozitif bir tam sayı olmak zorundadır. - `<sabit_silme>` Sabit mesajların silinip silinmeyeceği. Varsayılan olarak kapalıdır. (False)

source: Delete the messages between Message One and Message Two, providing the messages IDs. The first message ID should be the older message and the second one the newer. Example: - `[p]cleanup between 123456789123456789 987654321987654321` **Arguments:** - `<one>` The id of the message to cleanup after. This message won't be deleted. - `<two>` The id of the message to cleanup before. This message won't be deleted. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Elimine los mensajes entre el mensaje Uno y el mensaje dos, proporcionando los identificadores de los mensajes. El primer ID del mensaje debe ser el mensaje más antiguo y el segundo el más nuevo. Ejemplo: - `[p]limpieza entre 123456789123456789 987654321987654321` **Argumentos:** - `<one>` El id del mensaje a limpiar después. Este mensaje no se eliminará. - `<two>` El id del mensaje a limpiar antes. Este mensaje no se eliminará. - `<delete_pinned>` Si eliminar mensajes fijados o no. Por defecto es False
hu_hu: Törli az üzeneteket a két megadott üzenet között. Az első üzenet ID a régebbi, a második az újabb kell legyen. Például: - `[p]cleanup between 123456789123456789 987654321987654321` **Paraméterek:** - `<one>` Az első üzenet ID-je. Ez még nem lesz törölve. - `<two>` A második üzenet ID-je. Ez már nem lesz törölve. - `<delete_pinned>` Törölje-e a kitűzött üzeneteket is. Alapértelmezetten hamis (False)
nb_no: Slett meldingene mellom Melding En og Melding Two, og gjør om meldings-IDer. Den første melding-ID skal være den eldre meldingen og den nest den nyere. Eksempel: - `[p]cleanup between 123456789123456789 987654321987654321` **Arguments:** - `<one>` Inniden av meldingen til opprydding etterpå. Denne meldingen vil ikke bli slettet. - `<two>` beskjeden for å rydde opp før. Denne meldingen vil ikke bli slettet. - `<delete_pinned>` om å slette låste meldinger eller ikke. Standarder til usant
tr_tr: IDleri verilen iki mesaj arasındaki mesajları siler. İlk mesaj IDsi temizliğin başlangıç noktasını, ikinci mesaj IDsi ise bitiş noktasını belirtmelidir. Örnek: - `[p]cleanup between 123456789123456789 987654321987654321` **Seçenekler:** - `<bir>` Sonrasındaki mesajlar silinecek olan mesajın IDsi. Bu mesajın kendisi silinmez. - `<iki>` Öncesindeki mesajlar silinecek olan mesajın IDsi. Bu mesajın kendisi silinmez. - `<sabit_silme>` Sabit mesajların silinip silinmeyeceği. Varsayılan olarak kapalıdır. (False)

source: Delete the last X messages. Example: - `[p]cleanup messages 26` **Arguments:** - `<number>` The max number of messages to cleanup. Must be a positive integer. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Eliminar los últimos mensajes en X. Ejemplo: - `[p]mensajes de limpieza 26` **Argumentos:** - `<number>` El número máximo de mensajes a limpiar. Debe ser un entero positivo. - `<delete_pinned>` Si eliminar o no los mensajes fijos. Por defecto es False
hu_hu: Törli az utolsó X üzenetet. Például: - `[p]cleanup messages 26` **Paraméterek:** - `<number>` A törlendő üzenetek maximális száma. Pozitív egész szám kell legyen. - `<delete_pinned>` Törölje-e a kitűzött üzeneteket is. Alapértelmezetten hamis (False)
nb_no: Slett de siste X meldingene. Eksempel: -[p]cleanup messages 26` **Argumenter:** - `<number>` Maks antall meldinger som skal rengjøres. Må være et positivt heltall. - `<delete_pinned>` om for å slette låste meldinger eller ikke. Standarder til usant
tr_tr: Son X adet mesajı siler. Örnek: - `[p]cleanup messages 26` **Seçenekler:** - `<sayı>` En fazla kaç mesaj silineceği, pozitif bir tam sayı olmak zorundadır. - `<sabit_silme>` Sabit mesajların silinip silinmeyeceği. Varsayılan olarak kapalıdır. (False)

source: Clean up command messages and messages from the bot. Can only cleanup custom commands and alias commands if those cogs are loaded. **Arguments:** - `<number>` The max number of messages to cleanup. Must be a positive integer. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Limpiar mensajes de comandos y mensajes del bot. Sólo puede limpiar comandos personalizados y comandos de alias si se cargan esos programas. **Argumentos:** - `<number>` El número máximo de mensajes a limpiar. Debe ser un entero positivo. - `<delete_pinned>` Si desea eliminar o no los mensajes fijos. Por defecto es False
hu_hu: Törli a parancs üzeneteket és a bot válaszait. Csak akkor törli az egyéni és cog parancsokat, ha az alias parancsok és az adott cog-ok be vannak töltve. **Paraméterek:** - `<number>` A törlendő üzenetek maximális száma. Pozitív egész szám kell legyen. - `<delete_pinned>` Törölje-e a kitűzött üzeneteket is. Alapértelmezetten hamis (False)
nb_no: Rydd opp kommando meldinger og meldinger fra boten. Kan bare rense egendefinerte kommandoer og alias kommandoer hvis disse cogs er lastet. **Argumenter:** - `<number>` Maks antall meldinger å rydde opp. Må være et positivt heltall. - `<delete_pinned>` om å slette låste meldinger eller ikke. Standarder på False
tr_tr: Komut içeren mesajları ve bot'un attığı mesajları temizler. Eğer yüklülerse yalnızca özel komutlar ve takma ad modüllerinin komutları temizlenebilir. **Seçenekler:** - `<number>` En fazla kaç mesajın silineceği, pozitif tam sayı olmak zorundadır. - `<delete_pinned>` Sabitlenmiş mesajların silinip silinmeyeceği, varsayılan olarak kapalıdır.

source: Clean up messages owned by the bot. By default, all messages are cleaned. If a second argument is specified, it is used for pattern matching - only messages containing the given text will be deleted. Examples: - `[p]cleanup self 6` - `[p]cleanup self 10 Pong` - `[p]cleanup self 7 "" True` **Arguments:** - `<number>` The max number of messages to cleanup. Must be a positive integer. - `<match_pattern>` The text that messages must contain to be deleted. Use "" to skip this. - `<delete_pinned>` Whether to delete pinned messages or not. Defaults to False
es_es: Limpiar mensajes propiedad del bot. Por defecto, todos los mensajes se limpian. Si se especifica un segundo argumento, se utiliza para la coincidencia de patrones - sólo se eliminarán los mensajes que contengan el texto dado. Ejemplos: - `[p]limpieza propia 6` - `[p]limpieza propia 10 Pong` - `[p]limpieza propia 7 "" Verdadero` **Argumentos:** - `<number>` El número máximo de mensajes a limpiar. Debe ser un entero positivo. - `<match_pattern>` El texto que los mensajes deben contener para ser eliminados. Use "" para omitir esto. - `<delete_pinned>` Si eliminar mensajes fijados o no. Por defecto es False
hu_hu: A bot által elküldött üzenetek takarítása. Alapértelmezésből minden üzenet takarítva lesz. Ha egy második paraméter is meg van adva, minták párosítására lesz használva - csak a szöveget tartalmazó üzenetek lesznek törölve. Példák: - `[p]cleanup self 6` - `[p]cleanup self 10 Pong` - `[p]cleanup self 7 "" True` **Paraméterek:** - `<number>` A takarítandó üzenetek maximális száma. Pozitív számnak kell lennie. - `<match_pattern>` A szöveg, amit az üzeneteknek tartalmazniuk kell hogy törölve legyenek. Használd ezt: "" ennek a kihagyásához. - `<delete_pinned>` Hogy töröljön-e kitűzött üzeneteket. Alapértelmezett: hamis (false)
nb_no: Rydd opp meldinger som eies av boten. Som standard renses alle meldinger. Hvis et annet argument er angitt, den brukes til mønster som matcher - bare meldinger som inneholder den oppgitte teksten vil bli slettet. Eksempler: - `[p]cleanup self 6` - `[p]cleanup self 10 Pong` - `[p]cleanup self 7 "" True` **Argumenter:** - `<number>` Maks antall meldinger som skal rykkes opp. Må være et positivt heltall. - `<match_pattern>` Teksten som meldingene må slettes. Bruk "" for å hoppe over dette. - `<delete_pinned>` om å slette låste meldinger eller ikke. Standarder til False
tr_tr: Bot'a ait mesajları temizle. Varsayılan olarak, tüm mesajlar temizlenir. Eğer ikinci bir seçenek belirtilirse, eşleştirme için kullanılır - yanlızca belirtilmiş seçeneği içeren mesajlar silinir. Örnekler: - `[p]cleanup self 6` - `[p]cleanup self 10 Pong` - `[p]cleanup self 7 "" True` **Seçenekler:** - `<number>` En fazla kaç mesaj silineceği, pozitif tam sayı olmak zorundadır. - `<match_pattern>` Silinmek için bir mesajın ne içermesi gerektiği. Bunu atlamak için "" kullanın. - `<delete_pinned>` Sabitlenmiş mesajların silinip silinmeyeceği, varsayılan olarak kapalıdır.

source: Deletes duplicate messages in the channel from the last X messages and keeps only one copy. Defaults to 50. **Arguments:** - `<number>` The number of messages to check for duplicates. Must be a positive integer.
es_es: Elimina mensajes duplicados en el canal de los últimos mensajes X y conserva sólo una copia. Por defecto es 50. **Argumentos:** - `<number>` El número de mensajes a buscar duplicados. Debe ser un entero positivo.
hu_hu: A legutóbbi X üzenet közül törli a duplikált üzeneteket a csatornában, és csak egy üzenetet tart meg belőle. Alapértelmezetten 50 üzenet közül. **Paraméterek**: - `<number>` Az üzenetek száma, amik között a duplikáltakat keresi. Pozitív egész szám kell legyen.
nb_no: Sletter dupliserte meldinger i kanalen fra de siste X meldingene og beholder bare en kopi. Standard til 50. **Argumenter:** - `<number>` Antall meldinger for å sjekke etter duplikater. Må være et positivt heltall.
tr_tr: Son X mesajdan aynı olanları siler ve sadece bir tanesini bırakır. Varsayılan olarak 50. **Seçenekler:** - `<number>` Aynıları için denetlenecek mesaj sayısı, pozitif tam sayı olmak zorundadır.

source: {} doesn't look like a valid message ID.
es_es: {} no parece un ID de mensaje válido.
hu_hu: {} nem tűnik valós üzenet ID-nek.
nb_no: {} ser ikke ut som en gyldig meldings ID.
tr_tr: {} geçersiz mesaj ID'si.

source: {arg} is not an integer.
es_es: {arg} no es un entero.
hu_hu: {arg} nem egy egész szám.
nb_no: {arg} er ikke et heltall.
tr_tr: {arg} tamsayı değil.

source: {arg} is not a positive integer.
es_es: {arg} no es un entero positivo.
hu_hu: {arg} nem egy pozitív egész szám.
nb_no: {arg} er ikke et positivt heltall.
tr_tr: {arg} pozitif bir tamsayı değil.
